aws/amazon-freertos/vendors/cypress/MTB/psoc6/psoc6csp/hal/COMPONENT_PSOC6HAL/source/cyhal_usb_dev.c
        if (drvStatus == CY_USBFS_DEV_DRV_SUCCESS)
        {
            result = CY_RSLT_SUCCESS;
        }
    }

    return result;
}


cy_rslt_t cyhal_usb_dev_endpoint_abort(cyhal_usb_dev_t *obj, cyhal_usb_dev_ep_t endpoint)
{
    cy_rslt_t result = CYHAL_USB_DEV_RSLT_ERR;
    uint32_t  ep_num = CYHAL_USB_DEV_GET_EP_NUM(endpoint);

    if (CY_USBFS_DEV_DRV_SUCCESS == Cy_USBFS_Dev_Drv_Abort(obj->base, ep_num, &(obj->context)))
    {
        result = CY_RSLT_SUCCESS;
    }

    return result;
}


void cyhal_usb_dev_irq_enable(cyhal_usb_dev_t *obj, bool enable)
{
    uint32_t instance = (uint32_t)obj->resource.block_num;
    if (enable)
    {
        NVIC_ClearPendingIRQ(CYHAL_USBDEV_IRQ_N[instance]);
        NVIC_EnableIRQ(CYHAL_USBDEV_IRQ_N[instance]);
    }
    else
    {
        NVIC_DisableIRQ(CYHAL_USBDEV_IRQ_N[instance]);
    }
}


void cyhal_usb_dev_process_irq(cyhal_usb_dev_t *obj)
{
    Cy_USBFS_Dev_Drv_Interrupt(obj->base,
                               Cy_USBFS_Dev_Drv_GetInterruptCauseLo(obj->base),
                               &(obj->context));
}


cy_rslt_t cyhal_usb_dev_register_irq_callback(cyhal_usb_dev_t *obj, cyhal_usb_dev_irq_callback_t callback)
{
    cy_rslt_t result = CYHAL_USB_DEV_RSLT_ERR;
    cy_stc_sysint_t config;
    uint32_t instance = (uint32_t)obj->resource.block_num;

    /* Configure NVIC parameters */
    config.intrPriority = CYHAL_USB_DEV_DEFAULT_IRQ_PRIORITY;
    config.intrSrc = CYHAL_USBDEV_IRQ_N[instance];

    /* Setup interrupt in NVIC to trigger the callback */
    if (CY_SYSINT_SUCCESS == Cy_SysInt_Init(&config, (cy_israddress)callback))
    {
        result = CY_RSLT_SUCCESS;
    }

    return result;
}


void cyhal_usb_dev_register_event_callback(cyhal_usb_dev_t *obj, cyhal_usb_dev_event_t event, cyhal_usb_dev_event_callback_t callback)
{
    CY_ASSERT_L1(CYHAL_USB_DEV_IS_EVENT_VALID(event));
    uint32_t instance = (uint32_t)obj->resource.block_num;

    cyhal_usb_dev_event_callback_table[instance][event] = callback;
}


void cyhal_usb_dev_register_sof_callback( cyhal_usb_dev_t *obj, cyhal_usb_dev_sof_callback_t callback)
{
    uint32_t instance = (uint32_t)obj->resource.block_num;
    cyhal_usb_dev_sof_user_callback[instance] = callback;
}


void cyhal_usb_dev_register_endpoint_callback(cyhal_usb_dev_t *obj, cyhal_usb_dev_ep_t endpoint, cyhal_usb_dev_endpoint_callback_t callback)
{
    uint32_t endpoint_num = CYHAL_USB_DEV_GET_EP_NUM(endpoint);
    uint32_t instance = (uint32_t)obj->resource.block_num;

    CY_ASSERT_L1(CYHAL_USB_DEV_IS_EP_NUM_VALID(endpoint_num));

    cyhal_usb_dev_ep_handler_table[instance][CYHAL_USB_DEV_GET_EP_IDX(endpoint_num)]= callback;
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXUSBFS) */
